<img src = "pandas_logo.png">

# <center> Week 3 - Data Manipulation with Pandas</center>

<b>Lemma</b> Every finite set contains its supremum.

Proof: 

+ For the case $A=\{a\}$:

    $A = \{a\}$ is a singleton set, then clearly $\sup A = \max A = a$ .

    Next, assume we know that all sets of cardinality $m - 1$ have a maximal element.


+ Then for the case $1 < |A| < m$:  

    Let $a \in A$ be an arbitrary element and let $A^\prime = A - \{a\}$. 

    Since $A^\prime$ has $m-1$ elements, it has a maximum, denoted by $\max A^\prime = a^\prime$. 

    Then $\max\{a,a^\prime\}$ is the maximal element of $A$.

<b>Proposition</b> EC3389 has a most boring class.

Proof: Follows from above since the set of all EC3389 classes is finite.

<b>Conjecture</b> This is it.

<hr>

In [1]:
import pandas as pd # Our new friend
import numpy as np
%matplotlib inline

## Series and DataFrames

A Series is a <i>one</i>-dimensional array-like object containing:

+ Index column(s) labeling data

+ Data column

<b>Creating Series from Lists and NumPy Arrays</b>

In [2]:
idx = ["a", "b", "c", "d", "e"]                            # Some index

In [7]:
dt = np.random.uniform(low = 0, high = 10, size = (5,))    # Some 1-dimensional data 
s = pd.Series(data = dt, index = idx)

In [12]:
print(s.index)
print(s.values)
s               #immutable

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
[ 3.3854017   9.64998699  0.72001901  2.3278694   1.9079575 ]

a    3.385402
b    9.649987
c    0.720019
d    2.327869
e    1.907958
dtype: float64

In [13]:
dt = np.random.uniform(low = 0, high = 10, size = (5,4))    # Some multiple dimensional data 
cols = ["col1", "col2", "col3", "col4"]
df = pd.DataFrame(data = dt, index = idx, columns = cols)

In [22]:
print(df)
df.values

newdict = {"a": [5,5,4], "b": [5,6,7], "c": [1,3,77]}
aa = pd.DataFrame(newdict)      
print(aa)

       col1      col2      col3      col4
a  0.509840  6.884401  0.334777  6.491604
b  4.045694  8.988372  1.559654  7.601373
c  5.732860  5.536767  9.257742  1.912949
d  2.299390  4.370124  5.267167  1.870382
e  0.007397  3.920313  6.829878  6.756521
   a  b   c
0  5  5   1
1  5  6   3
2  4  7  77

Alternatively, you can create a DataFrame using dictionaries.

<b>Attributes and Functions</b>

Series and DataFrames come with <i>many</i> useful attributes and built-in functions, several of them inherited from NumPy. Let's take a look at some of them.

Attributes

+ values: NumPy Array

+ index: a pandas Index object

Functions

+ head()

+ tail()

+ mean()

+ std()

+ var()

+ describe()

+ plot()

In [32]:
df.head(2)
df.tail(2)
df.mean(axis=1)   # ax=0 if you want mean over cols

df.describe()     #descriptive stats

           col1      col2      col3      col4
count  5.000000  5.000000  5.000000  5.000000
mean   2.519036  5.939995  4.649843  4.926566
std    2.400666  2.054915  3.692406  2.800662
min    0.007397  3.920313  0.334777  1.870382
25%    0.509840  4.370124  1.559654  1.912949
50%    2.299390  5.536767  5.267167  6.491604
75%    4.045694  6.884401  6.829878  6.756521
max    5.732860  8.988372  9.257742  7.601373

<font color ="navy"><b>Index objects</b></font> Index objects also have methods such as append, drop, insert, delete.

In [34]:
idx = df.index

In [38]:
idx.isin(["a", "g", "z", "c"])   #which indices are in this list?

array([ True, False,  True, False, False], dtype=bool)

<b>Pandas + NumPy</b>

Because Series and DataFrames are array-like, you can treat them almost like NumPy arrays.

In [39]:
np.log(df)  # FAST elementwise application through NumPy (and in turn through C)

       col1      col2      col3      col4
a -0.673658  1.929258 -1.094292  1.870510
b  1.397653  2.195932  0.444464  2.028329
c  1.746215  1.711411  2.225460  0.648646
d  0.832644  1.474791  1.661493  0.626142
e -4.906642  1.366171  1.921307  1.910508

<b>Reading files a DataFrame</b>

Pandas has can read from several different kinds of files. Try autocompleting from pd.read_...

In [41]:
baby_names = pd.read_csv("baby_names_2014.csv")

In [47]:
print(baby_names.shape)
baby_names.head()

(33044, 3)

       name gender  count
0      Emma      F  20799
1    Olivia      F  19674
2    Sophia      F  18490
3  Isabella      F  16950
4       Ava      F  15586

<hr>

## Indexing and selection

### Selecting subsets of a Series

In [51]:
idx = ["a", "b", "c", "d", "a"] #  Now 'a' appears twice
dt = np.random.uniform(low = 0, high = 10, size = (5,))
s = pd.Series(data = dt, index = idx)
s

a    0.943238
b    0.642886
c    8.726100
d    1.823603
a    6.395374
dtype: float64

You can select a subset of a Series by calling the index label

In [52]:
s["b"]

0.64288557943828817

By calling the index position

In [53]:
s[2]  # This could also be a slice m:n

8.7261003630851359

By using a list (which returns another Series)

In [54]:
s[["a","b"]]

a    0.943238
a    6.395374
b    0.642886
dtype: float64

<font color = "navy">Or by boolean indexing</font>

In [56]:
# First check out what s > 2 does.
s[s > 5] # Returns a Series containing elements that satisfy the condition

c    8.726100
a    6.395374
dtype: float64

### Selecting subsets of a DataFrame

In [63]:
dt = np.random.uniform(low = 0, high = 10, size = (5,4))    # Some multiple dimensional data 
cols = ["col1", "col2", "col3", "col4"]
idx = ["a","b","c","d","a"]
df = pd.DataFrame(data = dt, index = idx, columns = cols)

In [64]:
df

       col1      col2      col3      col4
a  8.439865  8.129898  6.959712  5.436538
b  6.507045  4.037157  0.458759  5.028117
c  0.510402  4.723708  5.484136  8.189325
d  9.233235  1.207241  5.496824  4.880967
a  1.655952  1.886702  9.645046  1.110368

<b>Using ".ix"</b>

To select by label, use the ".ix" method

In [65]:
df.ix["a"]

       col1      col2      col3      col4
a  8.439865  8.129898  6.959712  5.436538
a  1.655952  1.886702  9.645046  1.110368

You can also restrict the columns

In [66]:
df.ix["a", ["col2"]]  # If "col2" not enclosed in a list, it returns a Series

       col2
a  8.129898
a  1.886702

Call by position

In [67]:
df.ix["a", ["col1", "col2"]]

       col1      col2
a  8.439865  8.129898
a  1.655952  1.886702

All rows of a particular column

In [68]:
df.ix[:, "col1"]

a    8.439865
b    6.507045
c    0.510402
d    9.233235
a    1.655952
Name: col1, dtype: float64

The method <i>.loc</i> works similarly to <i>.ix</i> but only on the labels

In [69]:
df.loc["a"]

       col1      col2      col3      col4
a  8.439865  8.129898  6.959712  5.436538
a  1.655952  1.886702  9.645046  1.110368

The method <i>.iloc</i> works similarly to <i>.ix</i> but only on the positions (integers)

In [73]:
df.iloc[2:4]    #see rows 2-4. . don't use loc b/c it can get confused with label names
                # e.g. if row  name is 5, loc5 gets you row NAMED 5, not row #5

       col1      col2      col3      col4
c  0.510402  4.723708  5.484136  8.189325
d  9.233235  1.207241  5.496824  4.880967

<b>Note</b> Some people would argue that you should use "loc" and "iloc", and avoid using "ix".

<hr>

## Function application

<b>Evaluating a function taking each element of a Series as argument</b>

To apply any <i>one-argument</i> function to each element of a Series, use .map

In [74]:
def signed_shifted_log(x):
    return np.sign(x) * np.log(np.abs(x) + 1)

def classify(x):
    value = signed_shifted_log(x)
    if value < 1:
        return "Tier A"
    elif value < 2:
        return "Tier B"
    else:
        return "Tier C"

In [82]:
#map() applies element-wise, going through the array 
#won't work by simply passing array as input b/c func assumes single-item inputs

In [83]:
s.map(signed_shifted_log)

a    0.664355
b    0.496454
c    2.274813
d    1.038014
a    2.000855
dtype: float64

In [84]:
s.map(classify)

a    Tier A
b    Tier A
c    Tier C
d    Tier B
a    Tier C
dtype: object

<b>Evaluating a function taking each column of a DataFrame as an argument</b>

In [85]:
def midpoint(x): # x is supposed to be an array of numerical values
    maximum = np.max(x)
    minimum = np.min(x)
    return (maximum - minimum)/2

The <i>apply</i> method returns a Series containing the evaluated value for each column

In [86]:
df.apply(midpoint)

col1    4.361416
col2    3.461328
col3    4.593144
col4    3.539478
dtype: float64

<b>Evaluating a function taking each entry of a DataFrame as argument</b>

The <i>applymap</i> selects each entry of DataFrame and applies a function to it.

In [89]:
df.applymap(classify)

     col1    col2    col3    col4
a  Tier C  Tier C  Tier C  Tier B
b  Tier C  Tier B  Tier A  Tier B
c  Tier A  Tier B  Tier B  Tier C
d  Tier C  Tier A  Tier B  Tier B
a  Tier A  Tier B  Tier C  Tier A

In [91]:
# use map for a series, applymap for a data frame
#map applies function to entire column (i.e. a series)
#applymap applies to all columns (so for a df)

￼<hr>

# Split-Apply-Combine

<img src = "split_apply_combine.png", width = 400>

In [102]:
baby_names = pd.read_csv("baby_names_2014.csv")   #re-try later w/ the multiyear data

In [103]:
baby_names.head()

       name gender  count
0      Emma      F  20799
1    Olivia      F  19674
2    Sophia      F  18490
3  Isabella      F  16950
4       Ava      F  15586

In [104]:
baby_names.shape

(33044, 3)

## <b>Aggregation</b>

<b>Applying a function to aggregate a group defined by one column</b>

In [105]:
baby_names[baby_names["name"] == "Vitor"].head()

        name gender  count
27087  Vitor      M     10

In [106]:
baby_names[baby_names.ix[:,"name"] == "Vitor"].head()

        name gender  count
27087  Vitor      M     10

Let's find out the total name count across the years.

In [107]:
name_count = baby_names.groupby(by = ["name"])["count"].agg(np.sum)
name_count.head()

name
Aaban        16
Aabha         9
Aabriella     5
Aadam        19
Aadan         8
Name: count, dtype: int64

Note that now "name" is the index, and the total sum of "count" per name is the new value.

<b>Exercise</b> Find the smallest year associated with each first baby name.

In [108]:
# Uncomment and complete the next line
#baby_names.groupby(...)[""].agg()

<b>Applying a function to aggregate a group defined more than one column</b>

Let's find out the total name count by name *and* gender.

In [113]:
name_count_by_gender = baby_names.groupby(by = ["name", "gender"])["count"].agg(np.sum)

In [114]:
name_count_by_gender.head(20)

name       gender
Aaban      M          16
Aabha      F           9
Aabriella  F           5
Aadam      M          19
Aadan      M           8
Aadarsh    M          18
Aaden      M         236
Aadhav     M          25
Aadhi      M           5
Aadhira    F          13
Aadhya     F         249
Aadi       M          54
Aadian     M           5
Aadil      M          11
Aadit      M          31
Aadith     M           9
Aaditri    F          10
Aaditya    M          40
Aadiv      M           5
Aadon      M           9
Name: count, dtype: int64

<font color="navy">You can also unstack the names to create a pivot table</b>

In [118]:
name_count = name_count_by_gender.unstack().fillna(0)  #separates sums by M and F

In [119]:
name_count

gender       F    M
name
Aaban        0   16
Aabha        9    0
Aabriella    5    0
Aadam        0   19
Aadan        0    8
Aadarsh      0   18
Aaden        0  236
Aadhav       0   25
Aadhi        0    5
Aadhira     13    0
Aadhya     249    0
Aadi         0   54
Aadian       0    5
Aadil        0   11
Aadit        0   31
Aadith       0    9
Aaditri     10    0
Aaditya      0   40
Aadiv        0    5
Aadon        0    9
Aadrika      5    0
Aadvik       0   11
Aadvika      7    0
Aadya      164    0
Aadyn        0   33
Aahan        0   26
Aahana      59    0
Aahil        0   65
Aahna       21    0
Aaiden       0   70
...        ...  ...
Zymiere      0    5
Zymir        0   55
Zymira       8    0
Zymire       0   12
Zynae        8    0
Zynia        7    0
Zyniah      13    0
Zynique      6    0
Zynovia      6    0
Zyon        30  112
Zyonna      39    0
Zyonnah      7    0
Zyquan       0   10
Zyra        44    0
Zyrah       19    0
Zyran        0    5
Zyree        0    8
Zyrell       0    7
Zyren        0   16
Zyria       14    0
Zyriah      36    0
Zyrihanna    5    0
Zyrin        0    5
Zyrion       0    9
Zyriyah      5    0
Zyron        0   13
Zyrus        0   10
Zyshawn      0    6
Zytaveon     0    7
Zyyon        0    6

[30579 rows x 2 columns]

In [120]:
name_count[:10000].tail()

gender    F  M
name
Ezariyah  5  0
Ezavier   0  8
Ezayah    0  5
Eze       0  6
Ezechiel  0  6

## Transformation

Instead of aggregating and returning <i>one</i> value, the output of <i>transform</i> has the same length as the original input.

Example: keep track of cumulative sum of baby names across the years

In [123]:
baby_names[baby_names["name"] == "Vitor"]#["count"].cumsum()
#baby_names("total_count") = baby_names.groupby(by= ["name"])["count"].transform(np.sum)
#sum by year

        name gender  count
27087  Vitor      M     10

This is useful when creating a new column

In [124]:
baby_names["cumulative"] = baby_names.groupby(by = ["name"])["count"].transform(np.cumsum)

## <font color = "navy"> Filtration</font>

The method <i>filter</i> applies a boolean function to a group, and returns the rows of that group only if the function evaluates to True.

In [125]:
def is_rare(x):
    return np.sum(x["count"]) < 20

In [126]:
rare_names = baby_names.ix[:500,:].groupby(by = ["name"]).filter(is_rare)

In [127]:
rare_names.head()

Empty DataFrame
Columns: [name, gender, count, cumulative]
Index: []

<hr>

# Combining DataFrames

<b>Merging on columns</b>

In [128]:
dt1 = {"name": ['Bernie', 'Sanders', 'Donald', 'Trump'], "value1":np.random.uniform(size =(4,))}
dt2 = {"name": ['Bernie', 'Sanders', 'Marco', 'Rubio'], "value2":np.random.uniform(size =(4,))}

In [129]:
df1 = pd.DataFrame(dt1)
df2 = pd.DataFrame(dt2)

In [130]:
df1

      name    value1
0   Bernie  0.691215
1  Sanders  0.380845
2   Donald  0.958619
3    Trump  0.370870

In [131]:
df2

      name    value2
0   Bernie  0.937214
1  Sanders  0.359809
2    Marco  0.665718
3    Rubio  0.605564

## Merge

The function <i>merge</i> combines DataFrames using a specified *column*.

In [141]:
#can do inner, left, right, and full outer join.. specify with the "how" parameter
merged = pd.merge(df1, df2, on = "name", how = "outer")    
merged

      name    value1    value2
0   Bernie  0.691215  0.937214
1  Sanders  0.380845  0.359809
2   Donald  0.958619       NaN
3    Trump  0.370870       NaN
4    Marco       NaN  0.665718
5    Rubio       NaN  0.605564

In [150]:
#merge on columns
#concat on rows/indeces

## Concat

My favorite way of combining DataFrames. It glues together a *list* (or tuple) of datasets by either stacking them on top of each other, or combining them by their indices.

In [151]:
dt1 = {"name": ['Bernie', 'Sanders', 'Donald', 'Trump'], "value1":np.random.uniform(size =(4,))}
dt2 = {"name": ['Bernie', 'Sanders', 'Marco', 'Rubio'], "value2":np.random.uniform(size =(4,))}
dt3 = {"name": ['Bernie', 'Sanders', 'Marco', 'Trump'], "value3":np.random.uniform(size =(4,))}

In [152]:
df1 = pd.DataFrame(dt1)
df2 = pd.DataFrame(dt2)
df3 = pd.DataFrame(dt3)

In [153]:
df1 = df1.set_index("name")
df2 = df2.set_index("name")
df3 = df3.set_index("name")

In [155]:
df1

           value1
name
Bernie   0.173790
Sanders  0.266209
Donald   0.713843
Trump    0.161039

In [156]:
df2

           value2
name
Bernie   0.931964
Sanders  0.554603
Marco    0.697085
Rubio    0.864959

In [157]:
df3

           value3
name
Bernie   0.193143
Sanders  0.177744
Marco    0.626426
Trump    0.820063

In [161]:
pd.concat([df1, df2, df3], axis=0) #row-wise

           value1    value2    value3
name
Bernie   0.173790       NaN       NaN
Sanders  0.266209       NaN       NaN
Donald   0.713843       NaN       NaN
Trump    0.161039       NaN       NaN
Bernie        NaN  0.931964       NaN
Sanders       NaN  0.554603       NaN
Marco         NaN  0.697085       NaN
Rubio         NaN  0.864959       NaN
Bernie        NaN       NaN  0.193143
Sanders       NaN       NaN  0.177744
Marco         NaN       NaN  0.626426
Trump         NaN       NaN  0.820063

In [165]:
pd.concat([df1, df2, df3], axis=1) #column-wise
#same as merge, but will work with >2 columns

           value1    value2    value3
Bernie   0.173790  0.931964  0.193143
Donald   0.713843       NaN       NaN
Marco         NaN  0.697085  0.626426
Rubio         NaN  0.864959       NaN
Sanders  0.266209  0.554603  0.177744
Trump    0.161039       NaN  0.820063

<hr>

# More information

This 2012 video is a bit outdated, but it still worth going through. Wes McKinney (creator of Pandas) uses Python 2.7, and the syntax has evolved just a little, so you might not be able to reproduce examples exactly. But it is not hard to figure out what you need to change.


https://www.youtube.com/watch?v=w26x-z-BdWQ


Wes McKinney's "Python for Data Analysis" is also quite interesting, but most of the information is available in the documentation website: 

http://pandas.pydata.org/pandas-docs/stable/

Be sure to check out, at the very least, "10 Minutes To Pandas".

I also recommend the Visualization chapter: http://pandas.pydata.org/pandas-docs/stable/visualization.html.